#include "delay_cfg.h"

///////////////////////////////////////////////////////////////////////////////
//////函	   数： void Delay_us(UINT32_T us)
//////功	   能： 微妙的延时函数
//////输入参数: 延时时间
//////输出参数: 无
//////说	   明： us的延时时间只支持100的整数倍（1,2,3。。。。。）
//////////////////////////////////////////////////////////////////////////////
void Delay_us( UINT32_T us )
{
	if( us == 0 )
	{
		return;
	}
	if( ( us != 0 ) && ( ( us % 100 ) != 0 ) )
	{
		DelayN_us( us );
	}
	else
	{
		SysTickLib_SetUsX100( us / 100 );
		while( SysTickCfg_GetUsX100() != 0 );
	}
}

///////////////////////////////////////////////////////////////////////////////
//////函	   数： void Delay_ms(UINT32_T ms)
//////功	   能： 毫秒的延时函数
//////输入参数: 延时时间
//////输出参数: 无
//////说	   明： 
//////////////////////////////////////////////////////////////////////////////
void Delay_ms( UINT32_T ms )
{
	if( ms != 0 )
	{
		SysTickLib_SetUsX100( ms * 10 );
		while( SysTickCfg_GetUsX100() != 0 );
	}
	else
	{
		return;
	}
}

///////////////////////////////////////////////////////////////////////////////
//////函	   数： void Delay_s(UINT32_T ms)
//////功	   能： 秒延时
//////输入参数: 延时时间
//////输出参数: 无
//////说	   明： 
//////////////////////////////////////////////////////////////////////////////
void Delay_s( UINT32_T s )
{
	if( s != 0 )
	{
		while( s-- )
		{
			Delay_ms( 1000 );
			WDT_RESET();
		}
	}
	else
	{
		return;
	}
}

///////////////////////////////////////////////////////////////////////////////
//////函	   数： void DelayN_us(UINT32_T us)
//////功	   能： 查询的方式，使用系统滴答定时器的作为延时计算
//////输入参数: 微妙的延时时间
//////输出参数: 无
//////说	   明： 
//////////////////////////////////////////////////////////////////////////////
void DelayN_us( UINT32_T us )
{
	if( us != 0 )
	{

		//---系统中断关闭
		CLI();
		//---保存系统滴答定时器的参数
		UINT32_T tempCTRL = 0, tempLoad = 0;
		SysTickLib_GetSysTick( &tempCTRL, &tempLoad );
		//---延时的最小时间单位
		if( us == 0 )
		{
			us = 1;
		}
		//---时间越小,时间进度越不准确
		if( us < 4 )
		{
			us = ( SYS_CLOCK_MHZ * us * 100 / 180 );
		}
		else if( us < 10 )
		{
			us = ( SYS_CLOCK_MHZ * us * 100 / 160 );
		}
		else
		{
			us = ( SYS_CLOCK_MHZ * us * 100 / 110 );
		}
		//---等待时间到达
		SysTickLib_WaitSysTick( us );
		//---恢复系统滴答定时器的参数
		SysTickLib_ReSetSysTick( tempCTRL, tempLoad );
		//---系统中断打开
		SEI();
	}
}
///////////////////////////////////////////////////////////////////////////////
//////函	   数： void DelayN_ms(UINT32_T ms)
//////功	   能： 查询的方式，使用系统滴答定时器的作为延时计算
//////输入参数: 毫秒的延时时间
//////输出参数: 
//////说	   明： 
//////////////////////////////////////////////////////////////////////////////
void DelayN_ms( UINT32_T ms )
{
	if( ms != 0 )
	{
		while( ms-- )
		{
			DelayN_us( 1000 );
		}
	}
	else
	{
		return;
	}
}

///////////////////////////////////////////////////////////////////////////////
//////函	   数： void DelayN_s(UINT32_T s)
//////功	   能： 查询的方式，使用系统滴答定时器的作为延时计算
//////输入参数: 秒的延时时间
//////输出参数: 
//////说	   明： 
//////////////////////////////////////////////////////////////////////////////
void DelayN_s( UINT32_T s )
{
	if( s != 0 )
	{
		while( s-- )
		{
			DelayN_ms( 1000 );
		}
	}
	else
	{
		return;
	}
}

///////////////////////////////////////////////////////////////////////////////
//////函	   数： void Delay_nop(UINT32_T nop)
//////功	   能： 系统时钟的延时
//////输入参数: 系统时钟延时的个数
//////输出参数: 无
//////说	   明： 
//////////////////////////////////////////////////////////////////////////////
void Delay_nop( UINT32_T nop )
{
	if( nop != 0 )
	{
		while( nop-- )
		{
			__ASM( "NOP" );
		}
	}
	else
	{
		return;
	}
}

///////////////////////////////////////////////////////////////////////////////
//////函	   数： void Delay_1us(UINT32_T us)
//////功	   能： 使用nop延时函数，进行1us的整数倍的延时时间的计算
//////输入参数: us延时的个数
//////输出参数: 无
//////说	   明： 
//////////////////////////////////////////////////////////////////////////////
void Delay_1us( UINT32_T us )
{
	if( us == 0 )
	{
		return;
	}
	else
	{
		UINT32_T i = 0;
		for( i = 0; i < us; i++ )
		{
			Delay_nop( ( SYS_CLOCK_MHZ - 1 ) );
		}
	}
}

///////////////////////////////////////////////////////////////////////////////
//////函	   数： void HAL_Delay(UINT32_T ms)
//////功	   能： 重写HAL库中的延时函数
//////输入参数: 
//////输出参数: 
//////说	   明： 
//////////////////////////////////////////////////////////////////////////////
void HAL_Delay( UINT32_T ms )
{
	//Delay_us(ms*100);
}
